In [51]:
import numpy as np
import pandas as pd
import pandas_datareader.data as web

#### sorting by row or index

### Series

In [4]:
zzz = pd.Series(range(4), index=['d','a','b','c'])
zzz.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [14]:
zzz2 = pd.Series([1,2,-3,4])
zzz2

0    1
1    2
2   -3
3    4
dtype: int64

In [15]:
zzz2.sort_values()

2   -3
0    1
1    2
3    4
dtype: int64

### DataFrame

In [5]:
zzzframe = pd.DataFrame(np.arange(8).reshape((2,4)),
index=['z','x'], columns=['d','a','b','c'])
zzzframe.sort_index()

   d  a  b  c
x  4  5  6  7
z  0  1  2  3

In [6]:
zzzframe.sort_index(axis=1)

   a  b  c  d
z  1  2  3  0
x  5  6  7  4

In [7]:
zzzframe.sort_index(axis=0)

   d  a  b  c
x  4  5  6  7
z  0  1  2  3

### Reverse ascending

In [8]:
zzzframe.sort_index(axis=1, ascending=False)

   d  c  b  a
z  0  3  2  1
x  4  7  6  5

In [17]:
zzzframe2 = pd.DataFrame({'b':[4,5,-2,2], 'a':[0,1,0,1]})
zzzframe2

   b  a
0  4  0
1  5  1
2 -2  0
3  2  1

In [18]:
zzzframe2.sort_values(by='b')

   b  a
2 -2  0
3  2  1
0  4  0
1  5  1

In [19]:
zzzframe2.sort_values(by='a')

   b  a
0  4  0
2 -2  0
1  5  1
3  2  1

In [20]:
zzzframe2.sort_values(by=['a','b'])

   b  a
2 -2  0
0  4  0
3  2  1
1  5  1

### Ranking
#### Ranking assigns ranks from one through the number of valid data points in an array. The rank methods for Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank

In [21]:
zzz = pd.Series([7, -5, 7, 4, 2, 0, 4])
zzz

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [22]:
zzz.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [23]:
zzz.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [24]:
zzz.rank(ascending='False', method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [27]:
zframe = pd.DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1], 'c':[-2,5,8,-2.5]})
zframe

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [28]:
zframe.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [30]:
zzz = pd.Series(range(5), index=['a','a','a','b','c'])
zzz

a    0
a    1
a    2
b    3
c    4
dtype: int64

In [31]:
zzz.index.is_unique

False

In [32]:
zzz['a']

a    0
a    1
a    2
dtype: int64

In [33]:
zzz['c']

4

###  indexing rows in a DataFrame

In [34]:
zdf = pd.DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [35]:
zdf

          0         1         2
a  0.404910 -2.446296 -0.743425
a  0.189607 -1.567507  0.198878
b  0.535426 -1.037029 -1.301824
b -1.365650 -0.797879  0.482919

In [37]:
zdf.loc['b']

          0         1         2
b  0.535426 -1.037029 -1.301824
b -1.365650 -0.797879  0.482919

In [38]:
zdf = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])
zdf

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [39]:
zdf.sum()

one    9.25
two   -5.80
dtype: float64

In [40]:
zdf.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [42]:
zdf.sum(axis='rows')

one    9.25
two   -5.80
dtype: float64

In [43]:
zdf.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [46]:
zdf.idxmax()

one    b
two    d
dtype: object

In [47]:
zdf.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [48]:
zdf.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [50]:
zz = pd.Series(['a','a','b','c'] * 4)
zz.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [52]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [53]:
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [54]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-08-09  0.000303 -0.011377  0.007063 -0.005417
2022-08-10  0.026195  0.015679  0.024300  0.026809
2022-08-11 -0.004432  0.007909 -0.007401 -0.006879
2022-08-12  0.021426  0.011091  0.017037  0.023619
2022-08-15  0.006334  0.006865  0.005344  0.001875

#### Correlation

In [55]:
returns['MSFT'].corr(returns['IBM'])

0.47612294047212267

In [57]:
returns.MSFT.corr(returns.IBM)

0.47612294047212267

In [58]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.436035  0.759958  0.685545
IBM   0.436035  1.000000  0.476123  0.444072
MSFT  0.759958  0.476123  1.000000  0.787170
GOOG  0.685545  0.444072  0.787170  1.000000

#### Covariance

In [56]:
returns['MSFT'].cov(returns['IBM'])

0.00015288938767493685

In [59]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000410  0.000151  0.000288  0.000260
IBM   0.000151  0.000294  0.000153  0.000143
MSFT  0.000288  0.000153  0.000350  0.000276
GOOG  0.000260  0.000143  0.000276  0.000350

In [60]:
returns.corrwith(returns.IBM)

AAPL    0.436035
IBM     1.000000
MSFT    0.476123
GOOG    0.444072
dtype: float64

In [61]:
returns.corrwith(volume)

AAPL   -0.081989
IBM    -0.114787
MSFT   -0.069015
GOOG   -0.081854
dtype: float64

#### Unique Values, Value Counts, and Membership

In [62]:
returns.corrwith(volume)

AAPL   -0.081989
IBM    -0.114787
MSFT   -0.069015
GOOG   -0.081854
dtype: float64

In [64]:
returns.corrwith(volume, axis='columns')

Date
2017-08-16         NaN
2017-08-17   -0.782552
2017-08-18    0.139208
2017-08-21   -0.187098
2017-08-22    0.478126
                ...
2022-08-09    0.506588
2022-08-10    0.632679
2022-08-11   -0.454876
2022-08-12    0.533624
2022-08-15    0.191308
Length: 1258, dtype: float64

#### Unique Values, Value Counts, and Membership

In [66]:
zzz = pd.Series(['c','a','d','a','a','b','b','c','c'])
zzz

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [68]:
uniques = zzz.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [69]:
zzz.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [70]:
pd.value_counts(zzz.values, sort= False)

c    3
a    3
d    1
b    2
dtype: int64

In [71]:
zzz

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [74]:
zmask = obj.isin(['b','c'])

In [75]:
zmask

0    False
1    False
2    False
3    False
dtype: bool